# FamilyMappingFile Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCExportOptions..::..FamilyMappingFile Property
IFCExportOptions Class See Also
---
Path to a file containing family mapping.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public string FamilyMappingFile { get; set; }
```

Visual Basic
---
```text
Public Property FamilyMappingFile As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ FamilyMappingFile {
	String^ get ();
	void set (String^ value);
}
```

# Remarks
The file, if specified, contains data describing how to map generic family instances to IFC containers (element types). This property may be empty, in which case the current mapping will be used. The default is an empty string.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
IFCExportOptions Class
Autodesk.Revit.DB Namespace